nathanlnw/TJ_TRUCK_LOCAL/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
	EventObj.Event_ID=8;//事件ID
	EventObj.Event_Len=len_write;//长度 7*2
	memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
	memcpy(EventObj.Event_Str,"有急事请速回话",EventObj.Event_Len);  
          Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj)); 
}

void Event_Read(void)
{
  u8 i=0;
  for(i=0;i<8;i++)
    {
	memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str)); 
       Api_RecordNum_Read(event_808, i+1, (u8*)&EventObj,sizeof(EventObj)); 
	
	EventObj_8[i].Event_ID=EventObj.Event_ID;
	EventObj_8[i].Event_Len=EventObj.Event_Len;
	EventObj_8[i].Event_Effective=EventObj.Event_Effective;
	memcpy(EventObj_8[i].Event_Str,EventObj.Event_Str,sizeof(EventObj.Event_Str));
//	memcpy(DisInfor_Affair[i],EventObj.Event_Str,20);
	//rt_kprintf("\r\n事件ID:%d  长度:%d  是否有效:%d(1显示0不显示) Info: %s",EventObj.Event_ID,EventObj.Event_Len,EventObj.Event_Effective,EventObj.Event_Str); 
	}
} 


void Event_Init(u8  Intype) 
{
  u8 i=0;

	  if(Intype==0)
	  {
	    EventObj.Event_Len=8; 
	    memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
	    memcpy(EventObj.Event_Str,"雨天路滑",8);
		EventObj.Event_Effective=1;
	  } 
	  else
	  if(Intype==1)
		{
		  EventObj.Event_Len=0;  
		  memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
		  EventObj.Event_Effective=0;
		}
	  
   for(i=0;i<8;i++)
   {
          EventObj.Event_ID=i+1;
          Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj)); 
   }
}

/*
          信息 
*/
//----------------------------------------------------------------
void MSG_BroadCast_Write_Init(void)
{
u8 len_write=8;
	MSG_BroadCast_Obj.INFO_TYPE=1;//类型
	MSG_BroadCast_Obj.INFO_LEN=len_write;//长度 4*2
	MSG_BroadCast_Obj.INFO_PlyCancel=1;//点播
	MSG_BroadCast_Obj.INFO_SDFlag=1;//发送标志位
	MSG_BroadCast_Obj.INFO_Effective=1;//显示有效
	memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
	memcpy(MSG_BroadCast_Obj.INFO_STR,"天气预报",MSG_BroadCast_Obj.INFO_LEN);  
	Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 

	MSG_BroadCast_Obj.INFO_TYPE=2;//类型
	memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
	memcpy(MSG_BroadCast_Obj.INFO_STR,"娱乐信息",MSG_BroadCast_Obj.INFO_LEN);  
	Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 
	
	MSG_BroadCast_Obj.INFO_TYPE=3;//类型
	memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
	memcpy(MSG_BroadCast_Obj.INFO_STR,"交通信息",MSG_BroadCast_Obj.INFO_LEN);  
	Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 
	
	MSG_BroadCast_Obj.INFO_TYPE=4;//类型
	memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
	memcpy(MSG_BroadCast_Obj.INFO_STR,"美食信息",MSG_BroadCast_Obj.INFO_LEN);  
	Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 

	MSG_BroadCast_Obj.INFO_Effective=0;//显示有效
	MSG_BroadCast_Obj.INFO_TYPE=5;//类型
	memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
	memcpy(MSG_BroadCast_Obj.INFO_STR,"记录信息",MSG_BroadCast_Obj.INFO_LEN);  
	Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 
	
	MSG_BroadCast_Obj.INFO_TYPE=6;//类型
	memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
	memcpy(MSG_BroadCast_Obj.INFO_STR,"事件信息",MSG_BroadCast_Obj.INFO_LEN);  
	Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 
	
	MSG_BroadCast_Obj.INFO_TYPE=7;//类型
	memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
	memcpy(MSG_BroadCast_Obj.INFO_STR,"时尚信息",MSG_BroadCast_Obj.INFO_LEN);  
	Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 
	
	MSG_BroadCast_Obj.INFO_TYPE=8;//类型
	memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
	memcpy(MSG_BroadCast_Obj.INFO_STR,"美容信息",MSG_BroadCast_Obj.INFO_LEN);  
	Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 
}

void MSG_BroadCast_Read(void) 
{
  u8 i=0;
  
  for(i=0;i<8;i++)
    {
	memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR)); 
	Api_RecordNum_Read(msg_broadcast, i+1, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 

	MSG_Obj_8[i].INFO_TYPE=MSG_BroadCast_Obj.INFO_TYPE;
	MSG_Obj_8[i].INFO_LEN=MSG_BroadCast_Obj.INFO_LEN;
	MSG_Obj_8[i].INFO_PlyCancel=MSG_BroadCast_Obj.INFO_PlyCancel;
	MSG_Obj_8[i].INFO_SDFlag=MSG_BroadCast_Obj.INFO_SDFlag;
	MSG_Obj_8[i].INFO_Effective=MSG_BroadCast_Obj.INFO_Effective;
       memcpy(MSG_Obj_8[i].INFO_STR,MSG_BroadCast_Obj.INFO_STR,sizeof(MSG_BroadCast_Obj.INFO_STR));
	
	//memcpy(DisInfor_Menu[i],MSG_BroadCast_Obj.INFO_STR,20);    
	//rt_kprintf("\r\n 消息TYPE:%d  长度:%d  是否点播:%d 是否显示有效:%d(1显示0不显示) Info: %s",MSG_BroadCast_Obj.INFO_TYPE,MSG_BroadCast_Obj.INFO_LEN,MSG_BroadCast_Obj.INFO_PlyCancel,MSG_BroadCast_Obj.INFO_Effective,MSG_BroadCast_Obj.INFO_STR); 
    }
}

void MSG_BroadCast_Init(u8  Intype)
{
  u8 i=0;

	  if(Intype==0)
	  {
	    MSG_BroadCast_Obj.INFO_LEN=8; 
		MSG_BroadCast_Obj.INFO_Effective=1;
	    memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR)); 
	    memcpy(MSG_BroadCast_Obj.INFO_STR,"北京你好",8);
	  } 
	  else
	  if(Intype==1)
		{
		  MSG_BroadCast_Obj.INFO_LEN=0;  		  
		  MSG_BroadCast_Obj.INFO_Effective=0;   
		  memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));    
		}
	  
   for(i=0;i<8;i++)
   {
       MSG_BroadCast_Obj.INFO_TYPE=i+1;
	Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 
   }
}

/*
      电话本
*/
void PhoneBook_Read(void)
{
  u8 i=0;

  for(i=0;i<8;i++)
  {    
      	Api_RecordNum_Read(phonebook, i+1, (u8*)&PhoneBook_8[i],sizeof(PhoneBook)); 
	//rt_kprintf("\r\n\r\n 电话本 TYPE: %d   Numlen=%d  Num: %s   UserLen: %d  UserName:%s \r\n",PhoneBook.CALL_TYPE,PhoneBook.NumLen,PhoneBook.NumberStr,PhoneBook.UserLen,PhoneBook.UserStr);  
  }
} 
void PhoneBook_Init(u8  Intype)
{
  u8 i=0;

