nathanlnw/TJ_TRUCK_LOCAL/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Sys_config.c
         rt_kprintf("\r\n        疲劳驾驶门限 连续驾驶门限 =  %d s   当天累计驾驶门限 = %d s   最小休息门限=%d s  最长停车门限= %d s\r\n",TiredConf_struct.TiredDoor.Door_DrvKeepingSec,TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec,TiredConf_struct.TiredDoor.Door_MinSleepSec,TiredConf_struct.TiredDoor.Door_MaxParkingSec); 
         rt_kprintf("\r\n        疲劳驾驶状态 Status_TiredwhRst =  %d   ACCON_timer = %d   ACCOFF_timer=%d \r\n",TiredConf_struct.Tired_drive.Status_TiredwhRst,TiredConf_struct.Tired_drive.ACC_ONstate_counter,TiredConf_struct.Tired_drive.ACC_Offstate_counter); 
         if(TiredConf_struct.Tired_drive.Status_TiredwhRst==2)
                  rt_kprintf("\r\n		  疲劳驾驶起始时间: %X-%X-%X %X:%X:%X \r\n",TiredConf_struct.Tired_drive.start_time[0],TiredConf_struct.Tired_drive.start_time[1],TiredConf_struct.Tired_drive.start_time[2],TiredConf_struct.Tired_drive.start_time[3],TiredConf_struct.Tired_drive.start_time[4],TiredConf_struct.Tired_drive.start_time[5]);  


         rt_kprintf("\r\n\r\n        心跳包发送间隔 =	%d s   TCP应答超时Dur = %d s	 TCP重传次数=%d 	驾驶员未登录时上报间隔= %d s\r\n",JT808Conf_struct.DURATION.Heart_Dur,JT808Conf_struct.DURATION.TCP_ACK_Dur,JT808Conf_struct.DURATION.TCP_ReSD_Num,JT808Conf_struct.DURATION.NoDrvLogin_Dur); 
         rt_kprintf("\r\n\r\n                                 UDP应答超时Dur = %d s	 UDP重传次数=%d 	                             \r\n",JT808Conf_struct.DURATION.UDP_ACK_Dur,JT808Conf_struct.DURATION.UDP_ReSD_Num);  
         rt_kprintf("\r\n        休眠时上报间隔 =	%d s   紧急报警时上报间隔 = %d s	缺省上报间隔=%d s	拐点上次角度= %d ° 非法移动阈值= %d m\r\n",JT808Conf_struct.DURATION.Sleep_Dur,JT808Conf_struct.DURATION.Emegence_Dur,JT808Conf_struct.DURATION.Default_Dur,JT808Conf_struct.DURATION.SD_Delta_maxAngle,JT808Conf_struct.DURATION.IllgleMovo_disttance); 

         rt_kprintf("\r\n\r\n		  缺省定距上报 =	 %d m	驾驶员未登录定距 = %d m	 休眠定距=%d m	 紧急报警定距= %d m \r\n",JT808Conf_struct.DISTANCE.Defalut_DistDelta,JT808Conf_struct.DISTANCE.NoDrvLogin_Dist,JT808Conf_struct.DISTANCE.Sleep_Dist,JT808Conf_struct.DISTANCE.Emergen_Dist); 

         rt_kprintf("\r\n\r\n		定时上报方式 = %d    定时缺省 = %d   定时未登录=%d  定时休眠=%d m   定时紧急= %d m \r\n",JT808Conf_struct.SD_MODE.DUR_TOTALMODE,JT808Conf_struct.SD_MODE.Dur_DefaultMode,JT808Conf_struct.SD_MODE.Dur_NologinMode,JT808Conf_struct.SD_MODE.Dur_SleepMode,JT808Conf_struct.SD_MODE.Dur_EmegencMode); 
         rt_kprintf("\r\n\r\n		定距上报方式 = %d    定距缺省 = %d   定距未登录=%d  定距休眠=%d m   定距紧急= %d m \r\n",JT808Conf_struct.SD_MODE.DIST_TOTALMODE,JT808Conf_struct.SD_MODE.Dist_DefaultMode,JT808Conf_struct.SD_MODE.Dist_NoLoginMode,JT808Conf_struct.SD_MODE.Dist_SleepMode,JT808Conf_struct.SD_MODE.Dist_EmgenceMode);  


         rt_kprintf("\r\n\r\n	   临时位置跟踪状态= %d    跟踪间隔 = %d  	持续时间=%d  持续当前计数器=%d  \r\n",JT808Conf_struct.RT_LOCK.Lock_state,JT808Conf_struct.RT_LOCK.Lock_Dur,JT808Conf_struct.RT_LOCK.Lock_KeepDur,JT808Conf_struct.RT_LOCK.Lock_KeepCnter);  
         rt_kprintf("\r\n\r\n	  车辆负载状态: ");
         switch(JT808Conf_struct.LOAD_STATE)
		{  
		case 1:
		   rt_kprintf("空车\r\n"); 
		  break;
		case 2:
		   rt_kprintf("半载\r\n"); 
		  break;		  
		case 3:
		   rt_kprintf("满载\r\n"); 
		  break;
		default:
		       JT808Conf_struct.LOAD_STATE=1;
		       Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
		   rt_kprintf("空车2\r\n");  
		  break;
		}
         rt_kprintf("\r\n\r\n  起始流水号: %d \r\n", JT808Conf_struct.Msg_Float_ID); 
	     rt_kprintf("\r\n\r\n             cyc_read:   %d ,     cyc_write :%d\r\n  \r\n",cycle_read,cycle_write);     		
         
		 rt_kprintf("\r\n DeviceID=%s \r\n	Tired prewarn %d   jt808:%d  位置汇报策略:%d  ",reg_str, TiredConf_struct.Tired_drive.PreWarn_Dur,JT808Conf_struct.BD_TiredDrv_preWarnValue,JT808Conf_struct.PositionSd_Stratage);	 
         //=====================================================================
         //API_List_Directories();
         //-----------  北斗模块相关  ---------
	     BD_list(); 

		 // ----    首次连接类型  --------------------
		 if(JT808Conf_struct.Link_Frist_Mode==1)
		 	{
                 rt_kprintf("\r\n\r\n   首次连接模式:   MainLink");    
		 	}
		 else
		 	{
                  rt_kprintf("\r\n\r\n   首次连接模式:  DNSR域名");     
		 	}

		if(DeviceNumberID[0]==0xFF)
			rt_kprintf("\r\n  =======> 尚未设置设备编号，请重新设置\r\n" );  
		else
			{
			rt_kprintf("\r\n 读取终端ID为 : "); 
			for(i=0;i<12;i++)
				rt_kprintf("%c",DeviceNumberID[i]);
			rt_kprintf("\r\n");
			}  
       //---------- SIM ID -----------------------------  
        	if(SimID_12D[0]==0xFF)
			rt_kprintf("\r\n  =======> 尚未设置SIMID_入网编号，请重新设置\r\n" );  
		else
			{
			rt_kprintf("\r\n 读取设备SIMID 入网ID 为 : "); 
			for(i=0;i<12;i++)
				rt_kprintf("%c",SimID_12D[i]);
			rt_kprintf("\r\n");
			} 
	  	// 短息中心号码
	  	 rt_kprintf("\r\n		   短息中心号码 :%s	 \r\n",JT808Conf_struct.SMS_RXNum);
	  	
 
}
FINSH_FUNCTION_EXPORT(DefaultConfig, DefaultConfig);     



/*
读参数配置文件
*/
	void SysConfiguration(void)
	{
			SetConfig();  
			ReadConfig();
			DefaultConfig();      
	}


	 


void RstWrite_ACConoff_counter(void) 
{
 
  if(TiredConf_struct.Tired_drive.Status_TiredwhRst==0)
  	return;
    Api_Config_write(tired_config,0,(u8*)&TiredConf_struct,sizeof(TiredConf_struct));
    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));  
}
//-------------------------------------------------------------------------------



void  idip(u8 *str)
{
   u8 Reg_buf[25];
   
    if (strlen((const char*)str)==0){
	  	rt_kprintf("\r\n		   当前鉴权码为: ");
              rt_kprintf(" %s\r\n		   鉴权码长度: %d\r\n",JT808Conf_struct.ConfirmCode,strlen((const char*)JT808Conf_struct.ConfirmCode));   

		return ;
	}
   else
   	{	
   	    if(strncmp((const char*)str,"clear",5)==0)
   	    	{
                   JT808Conf_struct.Regsiter_Status=0; 
		           rt_kprintf("     手动清除 鉴权码 !\r\n");        	     
			       DEV_Login.Operate_enable=0; 
				   DEV_Login.Enable_sd=0; 
				   DEV_Login.Sd_counter=0;
   	    	}
		else
	      {
                  memset(JT808Conf_struct.ConfirmCode,0,sizeof(JT808Conf_struct.ConfirmCode));
                  memcpy(JT808Conf_struct.ConfirmCode,str,strlen((const char*)str));
		     JT808Conf_struct.Regsiter_Status=1; 
		    rt_kprintf("     手动设置  鉴权码: %s\r\n",JT808Conf_struct.ConfirmCode);   
	 
